var eventsSrc =
	{"events":[{"id":52,"title":"Implementing an awesome UI/UX strategy","abstract":"In this session, we'll take a closer look at implementing a UI/UX strategy in a small team. We'll do a case study of how we built an awesome UI/UX for T-10, an app which won an award for the NASA Space Apps Challenge.","persons":[{"id":80,"full_public_name":"Ket Majmudar","abstract":"Ket has been developing for Mobile for 3years and comes from a web design/development background, his keen interests in helping grow and run the London Titanium user group along with being part of the award winning team that won Best In Class 'Most Inspiring' Space App T-10, makes him far too busy, so is learning to juggle projects. He also enjoys playing Bass in a rock band with friends.","avatar_path":"/system/avatars/80/large/ket-profile-tron-l2r_400x400.png?1408215918","twitter_name":"ketan"}]},{"id":64,"title":"Backbone Sync Adapter for Cloud Services","abstract":"using the backbone model/collection framework, one can seamlessly integrate Titanium Alloy with REST API datastore. In this session, we will discuss approaches for integrating Appcelerator Cloud Services using a Backbone Sync Adapter","persons":[{"id":97,"full_public_name":"Aaron Saunders","abstract":"","avatar_path":"/system/avatars/97/large/s4hPnlke_400x400.jpeg?1409062590","twitter_name":"aaronksaunders"}]},{"id":51,"title":"Developing for Wearable Devices","abstract":"In this session we will discuss the tools, resources and best practices for developing for wearable devices.","persons":[{"id":76,"full_public_name":"Erica Stanley","abstract":"","avatar_path":"/system/avatars/76/large/headshot_2013.png?1408127992","twitter_name":"ericastanley"}]},{"id":49,"title":"Avoiding Traps in Intergalactic Space Battles","abstract":"The last thing you want to happen when battling Imperial forces in space is to realize you're in an ambush and have to shout \"It's a trap!\" to your advancing forces. In this session, we'll discuss how to detect both deep space and geostationary orbit ambush tactics by the Imperial army.","persons":[{"id":77,"full_public_name":"Admiral Ackbar","abstract":"Admiral of the Rebel Fleet. Home planet: Mon Calamari. ","avatar_path":"/system/avatars/77/large/header.jpg?1408125304","twitter_name":"Ackbar"}]},{"id":10,"title":"Using JS to prototype for the Internet of Things","abstract":"Rapid prototyping for Google Glass, Wear and other wearables using JavaScript on Android.","persons":[{"id":78,"full_public_name":"Lance Gleason","abstract":"Lance Gleason has been a computer nut ever since his dad bought him a computer when he was a kid. After nearly a decade as a Java developer for companies like Kodak, CNN, and GE, he decided to end his addiction to heavy inheritance, static typing, and coding without tests. These days, he practices clean Ruby living with lots of well-tested code, class composition, and fun dynamic languages as a developer/startup CTO for hire with extensive experience in data science and committer on open source projects such as the Passbook-iOS, Asari and Active Asari Gems. He is known to practice interspecies pair (purr) programming with his orange tabby, Allie, and when he's not writing code, you will find him diving with sharks, trekking through Chernobyl, sampling wine, cheering on the Springboks or perfecting his biltong recipe.","avatar_path":"/system/avatars/78/large/lance_gleason-5f15befb8e094690c3cc9264e4b58772.jpg?1408459894","twitter_name":"lgleasain"}]},{"id":63,"title":"Memory management in Titanium apps","abstract":"Memory and leaks and Alloy, oh my! In this session, I'll cover basic memory management concepts in Titanium Classic and Alloy projects. I'll show ways to detect and fix memory leaks, go over some best practices, and do my best to show that Titanium itself is usually not the cause of most memory issues.","persons":[{"id":96,"full_public_name":"Tim Poulsen","abstract":"Software developer for Appcelerator, working on Alloy, the CLI, and tooling projects. Former master-trainer for Appcelerator. ","avatar_path":"/system/avatars/96/large/tim_poulsen.jpg?1408554012","twitter_name":"skypanther"}]},{"id":65,"title":"Enterprise-Level 2D Game Development with Titanium and Platino","abstract":"The session will touch on the Platino mobile game development engine specifics, but will also delve into how to organize and develop a truly Enterprise-level game with Titanium.  Included: How to combine Platino and Alloy to set up a game loop and how beginning programmers can get into game development with this easy and fun platform.","persons":[{"id":95,"full_public_name":"John Gould","abstract":"Parallel (as opposed to serial) entrepreneur.  Owner and President of Avatar Software, a company in Nashville specializing in custom .Net, JavaScript, mobile, and BI development projects.  Co-founder of Codex Labs, premier Titanium training partner in the Southeast US.  Co-founder of Avatar Technical Staffing.  Loves dabbling in mobile game development, because if he can't find the exact game he wants to play, why not just build it instead?","avatar_path":"/system/avatars/95/large/33a5cbe.jpg?1409062624","twitter_name":"AvatarJohn"}]},{"id":16,"title":"Debugging Javascript: From 0 to Hero","abstract":"During our time together I will share how to debug JavaScript in the browser console and JavaScript best practices for easier debugging. I will use Chrome, Firefox, and yes; even Internet Explorer. Topics included will be setting breakpoints, coded breakpoints, watches, console.log(), http requests, useful console extensions, and console programming.","persons":[{"id":30,"full_public_name":"Chris Morrow","abstract":"I'm a Senior UI Developer at Soltech, Inc. I've worked in the web development field for over 16 years. I've used a number of web technologies including Flash, Flex, Javascript, jQuery, AJAX, and HTML5. Throughout my career I have maintained focus on the UI and the user experience.","avatar_path":"/system/avatars/30/large/Chris-madhatter-BW.jpg?1408129182","twitter_name":"_ChrisMorrow"}]},{"id":15,"title":"8-bit Game Music with Web Audio API","abstract":"8-bit gaming and music is back – big time! Whether you are creating a soundtrack for a game, writing chiptunes or just having fun, you’ll want to recreate that classic sound. In this session we’ll look at how you can create audio in the browser using oscillators with the Web Audio API and JavaScript. We’ll also explore the capabilities of a library called Band.js.","persons":[{"id":23,"full_public_name":"Brian Rinaldi","abstract":"Brian Rinaldi is the Developer Content Manager at Telerik where he manages the Telerik Developer Connection. Brian is a frequent speaker and author. Brian founded the popular site Flippin' Awesome (now the Modern Web) and is co-editor of the Mobile Web Weekly newsletter.","avatar_path":"/system/avatars/23/large/me_stlucia_sm2.jpg?1407108929","twitter_name":"remotesynth"}]},{"id":29,"title":"Node.js on a PaaS","abstract":"<p>You can run node.js applications today on a variety of Platform-as-a-Service (PaaS) environments, including Azure, Cloud Foundry, Heroku, Nodejitsu, etc.  Running on a PaaS makes it easy to host and scale your application on the public internet.\r\n\r\n<p>But, as Uncle Ben says, with great power comes some contraint. Or maybe that was someone else.\r\n\r\n<p>You won't get as many knobs and dials to turn when you use a PaaS compared to some other deployment stories.  But you can generally live without them, just fine.\r\n\r\n<p>This talk will cover the awesome parts about running on a PaaS, and how to deal with some of the constraints that come along with it.","persons":[{"id":55,"full_public_name":"Patrick Mueller","abstract":"Patrick Mueller is an IBMer working in the Raleigh, NC area.  He has been using node.js for a few years now, starting with contributing debug tooling to the Apache Cordova project.  Currently he is a developer advocate for IBM's Bluemix PaaS product, based on the open source Cloud Foundry project.","avatar_path":"/system/avatars/55/large/2010-03-12-bw-450x450-orton.jpg?1407519894","twitter_name":"pmuellr"}]},{"id":45,"title":"Teach JS About Aesthetics with Machine Learning ","abstract":"Learn how to teach JS about aesthetics with machine learning by exploring the fundamental concepts and algorithms behind it. \r\n\r\nMove over Number 5: Artificial Intelligence is a relic of 1986. It's 2014: the era of Machine Learning + Big Data.\r\n\r\nMachine learning helps power everything from Google Now to the lowly OS X Preview app — but you don't have to be a Prolog or eCommerce geek to harness its power!\r\n\r\nIn this session, software developer and instructor Jonathan Martin of Big Nerd Ranch, will give you a whirlwind tour of the fundamental concepts and algorithms in machine learning, then explore a front-end application: selecting the \"best\" photos to feature on our photo sharing site.\r\n\r\nDon't expect mathematically laborious derivations of SVM kernels or the infinite VC dimension of Neural Nets, but we will gain enough intuition to make informed compromises (thanks to the No Free Lunch theorem, everything is a compromise) in our pursuit of aesthetically-intelligent machines.","persons":[{"id":72,"full_public_name":"Jonathan Martin","abstract":"With more than seven years experience in software development and three years in commercial web development, Jonathan Martin is currently a front-end and back-end software developer and instructor at Big Nerd Ranch. He makes the world a better place for consulting clients with front-end development using Rails. He also bores knowledge-hungry students with the \"wats\" of JavaScript.\r\n","avatar_path":"/system/avatars/72/large/avatar.png?1408041461","twitter_name":"nybblr"}]},{"id":22,"title":"Advanced cross-platform development","abstract":"This session is about cross-platform thinking, covering the most important aspects of cross-platform development (mobile or not), how it applies to mobile and how Titanium can help you in the creation of native mobile apps that follow the platform's user interface guidelines.","persons":[{"id":48,"full_public_name":"Ricardo Alcocer","abstract":"18+ years of experience in software development.  Author of Titanium Alloy in Action.  Currently work as Lead developer evangelist @ Appcelerator","avatar_path":"/system/avatars/48/large/51af324f24c415140bcef0b489e89dc1_400x400.png?1408460021","twitter_name":"ricardoalcocer"}]},{"id":61,"title":"Make It Work","abstract":"Struggling with what your designer actually means? Misunderstanding your developer's needs? Frustrating your client with poor team communication? In this session, Brandy Porter explores the two mindsets of designers and developers, suggests removing the \"fence\" between the two contributors, and offers support for fostering collaboration and ownership among designers and developers equally. The session will explore the issue at hand, and offer solutions and techniques to make your next project run more smoothly.","persons":[{"id":24,"full_public_name":"Brandy Porter","abstract":"Director of Design and Instructor at Big Nerd Ranch. ","avatar_path":"/system/avatars/24/large/CroppedSmile_BW.jpg?1407169364","twitter_name":"@chickerbp"},{"id":92,"full_public_name":"Kristin Marsicano","abstract":"Kristin Marsicano is an Android developer, team manager, and instructor at Big Nerd Ranch.  She is passionate about software development, learning, and the intersection of the two. Throughout the years Kristin has designed and implemented mobile applications in industry, researched and published on the usability and human factors aspects of mobile interfaces in academia, served as a consultant for Fortune 100 wireless carriers, and even participated in Google's exploration of a visual programming language for Android for use in Computer Science education.","avatar_path":"/system/avatars/92/large/KVM_400x400.jpg?1408482226","twitter_name":"kristinmars"}]},{"id":57,"title":"High Performance Websocket","abstract":"In this talk we’ll review where WebSockets fits in the spectrum of real-time technologies and then go over best practices for creating a secure, high performance, real-time application.","persons":[{"id":82,"full_public_name":"Wesley Hales","abstract":"Wesley Hales is an author, occasional speaker and Lead Software Developer at Shape Security.\r\n\r\nIn his spare time, Wesley works on onslyde and loadreport.js.\r\nYou can read his <a href=\"http://wesleyhales.com\">articles</a>, or follow him on twitter <a href=\"http://twitter.com/wesleyhales\">@wesleyhales</a>.","avatar_path":"/system/avatars/82/large/velocityspeakers-029-square.png?1408373201","twitter_name":"wesleyhales"}]},{"id":41,"title":"Beginning Node.js Workshop","abstract":"Node.js has taken the developer world by storm. If you want to learn Node or are just curious about what programming in Node is like, this workshop is for you! This is a hands-on workshop for people new to Node. The course material will be \"Learn You The Node.js For Much Win!\" from http://nodeschool.io/.","persons":[{"id":12,"full_public_name":"Toby Ho","abstract":"Toby Ho is a veteran JavaScript developer in Atlanta. He blogs at tobyho.com and is passionate about helping others learn. He is active in the open source community where his proudest work is Test’em - a Javascript test runner.","avatar_path":"/system/avatars/12/large/avatar.jpg?1408126251","twitter_name":"airportyh"}]},{"id":37,"title":"Transforming Enterprises: Our visual journey from From traditional .NET to D3, Angular and Bootstrap","abstract":"Transforming Enterprises: Our visual journey from From traditional .NET to D3, Angular and Bootstrap","persons":[{"id":67,"full_public_name":"Sanjay Bhatia","abstract":"Sanjay is the founder and CEO of Izenda and is focused on creating a visualization-powered global paradise.","avatar_path":"/system/avatars/67/large/SanjayGT.jpeg?1407881094","twitter_name":"datasanj"}]},{"id":44,"title":"How OCD is your CSS?","abstract":"Learn best practices for writing reusable and scalable CSS with software developer Jason Reece of Big Nerd Ranch. Intended for developers of all levels who are familiar with the basics of Sass, Reece will share the fundamental concepts of OOCSS and SMACSS and discuss how to use css-burrito to help organize your code. The session will introduce the css-burrito components pattern, outline a suggested style guide and share must-have Sass snippets for any project.","persons":[{"id":69,"full_public_name":"Jason Reece","abstract":"","avatar_path":"/system/avatars/69/large/l2ydfcqci97v47d29zhh_400x400.jpeg?1408460078","twitter_name":"@jason_reece"}]},{"id":46,"title":"Angular Animation","abstract":"Angular gives us some pretty powerful tools to add motion to our applications. But how does it work? We'll start by reviewing some of the basics of CSS animation, then talk about the tools ng-animate gives us refine and time how content is displayed.","persons":[{"id":74,"full_public_name":"Michael Johnson","abstract":"Senior Front End at Huge Inc. ","avatar_path":"/system/avatars/74/large/HBUxc7yt_400x400.jpeg?1408459974","twitter_name":"bluekayaks"}]},{"id":81,"title":"How to interact with your front-end developer","abstract":"This talk gives a fascinating look into the multidisciplinary roles of development with a team that consists of both front-end and back-end developers and how they can effectively work together. The ultimate goal is to create great user experiences.","persons":[{"id":108,"full_public_name":"Natalie Kozlowski","abstract":"","avatar_path":"/system/avatars/108/large/154912.jpg?1408980617","twitter_name":"NRKozlowski"}]},{"id":62,"title":"From SVG to WebGL","abstract":"SVG's, Canvas, and WebGL are three amazing technologies that bring websites to life. This talk will cover all three technologies, when to use them, how to use them and great examples of them at their best.","persons":[{"id":58,"full_public_name":"James Charlesworth","abstract":"I work at The Home Depot as a Frontend Software Engineer.","avatar_path":"/system/avatars/58/large/me.jpeg?1408495537","twitter_name":"_jcharlesworth"}]},{"id":7,"title":"Adventures in Cross-platform","abstract":"I'll discuss my experiences developing cross-platform apps, challenges, issues, and how I've dealt with them. Some funny stories about dealing with clients and designers, and how to manage expectations.","persons":[{"id":18,"full_public_name":"Jason Kneen","abstract":"Freelance Web/App/Mobile Developer as @bouncingfish • Speaker • Creator of @tweet4me, @buffer4me • TCAD + TCD Certified Developer/Instructor • Titanium Titan","avatar_path":"/system/avatars/18/large/avatar.jpg?1406661852","twitter_name":"jasonkneen"}]},{"id":47,"title":"Don't Fear the Hybrid","abstract":"Titanium offers tremendous opportunity, and Enterprise is rapidly getting onboard to implement their mobile initiatives. But if you want a useful BI app, Titanium becomes noticeably lacking in its charting capabilities. By using a hybrid approach, you can bridge this gap and create beautiful Enterprise apps.","persons":[{"id":75,"full_public_name":"Patrick Seda","abstract":"Patrick is a Mobile Application Architect consultant and has created apps for all sizes of clients, including several Fortune 500 clients. Currently the Technical Lead at Propelics, he helps define and orchestrate all Enterprise app development. Formerly a Professional Services Architect for Appcelerator, he is a Titanium fanboy who loves contributing back to the community.","avatar_path":"/system/avatars/75/large/pxtrickAtThatConference_crop.jpg?1408119306","twitter_name":"pxtrick"}]},{"id":91,"title":"AngularJS Bootcamp I","abstract":"In this session, we will take a look at Angular - a new MVC framework by Google. We will discuss some of the terminology that Angular offers, and see how we can use that to develop highly interactive, dynamic web applications.\r\nAngular embraces HTML and CSS, allowing you to extend HTML towards your application, and uses plain JavaScript which makes your code easy to reuse, and test.\r\nTopics covered (Bootcamp I + II)\r\n\r\nBootstrapping an AngularJS application using ng-app\r\nng-init and the evaluation {{ }} directive\r\nA brief look at $rootScope\r\nng-model\r\nControllers, Dependency Injection, and the View-Model ($scope)\r\nLooping using ng-repeat\r\nForms using ng-form, form validation and submission in AngularJS\r\nAngular provided filters and how to write our own\r\nFactories\r\nMaking AJAX requests using $http\r\nRouting and route params using $routeProvider and $routeParams\r\nNote: This is an intro level talk. It is targeted towards developers who are curious about Angular and want to learn about the fundamental features and concepts in Angular.","persons":[{"id":115,"full_public_name":"Raju Gandhi","abstract":"I am a Software Craftsman with over a decade of experience building Web Applications and Enterprise Software and I love to build great software","avatar_path":"/system/avatars/115/large/me2_400x400.png?1409064068","twitter_name":"looselytyped"}]},{"id":8,"title":"Workshop: JavaScript Developer's Toolchain ","abstract":"This is a hands-on workshop. Please bring your laptop!\r\n\r\n*** This workshop requires separate registration and is not included in the main conference fee.\r\n\r\nThis workshop will help get you up to speed on modern tools and techniques for building web apps. This session focuses on JavaScript not in the browser, but on the server and command line. We'll explain and work with tools such as nodejs, npm, grunt, bower, yeoman and others. This is a fast-paced session to get you setup and working with the tools that JavaScript devs use to build webapps.\r\n","persons":[{"id":7,"full_public_name":"Pratik Patel","abstract":"Pratik Patel is the CTO of Atlanta based startup TripLingo. He’s also an author, speaker, and consultant helping technologists build great apps, and business people make the most of technology. After many years in the big corporate world in places such as New York, London and Hong Long, he’s in the startup space now and hacks iOS, Android, Java, HTML5, CSS3, JavaScript, Rails, and ..... well everything except Perl. You can follow him on twitter at @prpatel.","avatar_path":"/system/avatars/7/large/profile-pic-09-11-2011.jpg?1406354223","twitter_name":""}]},{"id":55,"title":"Using Bluetooth (BLE) to Enhance User Engagement","abstract":"This session will introduce developers to a number of different ways in which they can use BLE technology to increase user engagement. We will look at using BLE in Retail, Education, and the Arts.","persons":[{"id":81,"full_public_name":"Stephen Feather","abstract":"","avatar_path":"/system/avatars/81/large/n747527867_2041530_7318_400x400.jpg?1408461618","twitter_name":"stephenfeather"}]},{"id":48,"title":"Building Blocks for Isomorphic JavaScript Applications","abstract":"Learn about the tools and techniques for building Isomorphic JavaScript apps.","persons":[{"id":66,"full_public_name":"Chris Aquino","abstract":"As Director of Front-End Engineering, Chris Aquino leads Big Nerd Ranch’s web team, which specializes in cross-platform app development and training for Open Web technologies. He is also the author and senior instructor of Big Nerd Ranch's \"Cross-Platform JavaScript Apps\" training course. With more than a decade of development experience, his skills and expertise range from Java and Python on the server to all things JavaScript, in the browser and beyond.\r\n\r\nBefore joining Big Nerd Ranch nearly three years ago, Aquino worked as a software engineer for Monumental Interactive. For the last four years, he has volunteered for the Atlanta chapter of the American Institute of Graphic Arts (AIGA) on the sustainability committee. \r\n\r\nAquino graduated from Georgia Tech with a bachelor of science in technology and culture with a focus on computational media and cognitive science.","avatar_path":"/system/avatars/66/large/profile_400x400.jpg?1408123964","twitter_name":"@radishmouse"}]},{"id":92,"title":"AngularJS Bootcamp II","abstract":"AngularJS Bootcamp I\r\n\r\nIn this session, we will take a look at Angular - a new MVC framework by Google. We will discuss some of the terminology that Angular offers, and see how we can use that to develop highly interactive, dynamic web applications.\r\nAngular embraces HTML and CSS, allowing you to extend HTML towards your application, and uses plain JavaScript which makes your code easy to reuse, and test.\r\nTopics covered (Bootcamp I + II)\r\n\r\nBootstrapping an AngularJS application using ng-app\r\nng-init and the evaluation {{ }} directive\r\nA brief look at $rootScope\r\nng-model\r\nControllers, Dependency Injection, and the View-Model ($scope)\r\nLooping using ng-repeat\r\nForms using ng-form, form validation and submission in AngularJS\r\nAngular provided filters and how to write our own\r\nFactories\r\nMaking AJAX requests using $http\r\nRouting and route params using $routeProvider and $routeParams\r\nNote: This is an intro level talk. It is targeted towards developers who are curious about Angular and want to learn about the fundamental features and concepts in Angular.","persons":[{"id":115,"full_public_name":"Raju Gandhi","abstract":"I am a Software Craftsman with over a decade of experience building Web Applications and Enterprise Software and I love to build great software","avatar_path":"/system/avatars/115/large/me2_400x400.png?1409064068","twitter_name":"looselytyped"}]},{"id":59,"title":"Decentralized Consensus and the Death of the Server","abstract":"Trust nobody unless it's everybody. Gordon will be discussing the problems with the centralization of information and leading an interactive demonstration of how to implement a completely decentralized peer-to-peer voting system using Node.js. ","persons":[{"id":83,"full_public_name":"Gordon Hall","abstract":"I am a Senior Software Engineer at BitPay, dividing my time between developing our core product and contributing to our various open source projects. I am passionate about using technology as a means for protecting personal freedom and deprecating the necessity of authority and centralization in all facets of society.","avatar_path":"/system/avatars/83/large/headshot.jpg?1408398755","twitter_name":"sp0rkyd0rky"}]},{"id":12,"title":"Theory and Practice of Functional Reactive Javascript","abstract":"The re-emergence of functional programming coincides nicely with the JavaScript renaissance. But where does the UI fit in?\r\n\r\nIn this talk we'll cover the core concepts of Functional Reactive Programming while learning a practical application of them using Bacon.js. You'll learn how to build user interface components in a clear, declarative style by modeling both user interaction and back-end processing using one clean abstraction: streams of events.\r\n","persons":[{"id":21,"full_public_name":"Pete Hodgson","abstract":"Pete is a Lead Consultant at ThoughtWorks. He helps teams get more awesome at delivering maintainable software at a sustainable pace, using agile practices like test-driven design, pairing and continuous delivery. After horrible experiences with javascript in the early 2000s Pete saw the light and fell in love with this quirky little language while leading a team building a pure-JavaScript single-page mobile banking application. He was also an early contributor to the Calatrava framework.","avatar_path":"/system/avatars/21/large/Pete_Headshot.jpeg?1406933289","twitter_name":"ph1"}]},{"id":32,"title":"Building JavaScript Visualizations Part 1","abstract":"Adding data visualizations to your web site doesn't have to involve complex, complicated frameworks. There are many open source JavaScript visualization libraries suitable even for novice web designers and web developers. This presentation introduces several of those libraries and the types of visualizations they can create. ","persons":[{"id":27,"full_public_name":"Stephen A Thomas","abstract":"Stephen specializes in front-end development at Georgia Tech’s Department of Education Technology where he is helping to build the <a href=\"http://www.oaeproject.org\">Open Academic Environment</a>. He is the author of <a href=\"http://www.amazon.com/Stephen-A.-Thomas/e/B000APYM22\">several books</a> on the Internet and networking technology and has written about JavaScript development for <a href=\"http://mobile.smashingmagazine.com/2013/07/22/simple-responsive-images-with-css-backgrounds/\">Smashing Magazine</a>, <a href=\"http://www.sitepoint.com/unit-testing-backbone-js-applications/\">sitepoint</a> and <a href=\"http://ui-cloud.com/web-based-visualization-part-1-the-d3-js-key-concept/\">others</a>. His most recent book is <em>Building JavaScript Visualizations</em> from No Starch Press.","avatar_path":"/system/avatars/27/large/me.png?1407255208","twitter_name":"stephen_thomas"}]},{"id":74,"title":"HTML5 for the Mobile Web – Firefox OS","abstract":"Firefox OS is an open source operating system for mobile phones designed entirely around HTML5, Javascript, CSS and open web standards. By leveraging the inherent advantages of web development and giving developers access to hardware through web standards, we can make an open and affordable mobile web a reality. In this talk Jason Weathersby from Mozilla will show how Firefox OS works, how to build and debug apps for it, and how end users will benefit from this open alternative to other platforms. ","persons":[{"id":102,"full_public_name":"Jason Weathersby","abstract":"Jason Weathersby is a Technical Evangelist for Mozilla, evangelizing Firefox OS. He is also a committer on the BIRT project at the Eclipse Foundation, and has co-authored several books and written many articles on BIRT integration. He is a proponent of HTML5, the Open Web and Open Source and is a regular contributor to the Mozilla Hacks blog.  Jason has over 20 years experience in the software development field, ranging from real time process control to business intelligence software. ","avatar_path":"/system/avatars/102/large/JasonWeathersby380.JPG?1408657220","twitter_name":"jasonweathersby"}]},{"id":85,"title":"OSS and Titanium","abstract":"Generic title for Titanium talk topic. I will update with more details soon.","persons":[{"id":112,"full_public_name":"Tony Lukasavage","abstract":"OSS engineer working at Appcelerator, working on Titanium, Alloy, Hyperloop, triple, and node.js. I like whiskey and fighting.","avatar_path":"/system/avatars/112/large/face.jpg?1408989661","twitter_name":"tonylukasavage"}]},{"id":87,"title":"Using Promises to get out of callback misery","abstract":"REPL is a cornerstone of javascript development that can make your code challenging and messy, not to mention error prone.  we'll cover how to sidestep this with using promises","persons":[{"id":57,"full_public_name":"Andrew Zuercher","abstract":"","avatar_path":"/system/avatars/57/large/3272225.jpg?1409062130","twitter_name":"Bahzuercher"}]},{"id":67,"title":"Debugging, Profiling, Heap Dumping, Scaling and other fix-it techniques in Node.js","abstract":"When a Node app isn’t making it through the periods of load, how do you get to the root of the problem. Using only open source tools, I’ll show you how to look inside Node, Modules and V8 to discover where the memory or processor is hung up or the data has gotten corrupt or the errors are being thrown. Also I will share some sauce of scaling on demand in production. ","persons":[{"id":98,"full_public_name":"Shubhra Kar","abstract":"Shubhra Kar, Director, Products and Systems Engineering at StrongLoop Inc., is an accomplished Node and J2EE technologist with extensive global expertise as an architect, management consultant, product manager, and thought leader. Focussed on emerging tech, for over 15 years and across three continents, he has built and delivered successful solutions with Fortune 500 corporations, helping them bridge the gap between business and IT.","avatar_path":"/system/avatars/98/large/Pic_ShubhraKar.jpg?1408578311","twitter_name":"@shubhrakar"}]},{"id":98,"title":"Getting fired up about Ember.js","abstract":"Ember.js is a new client-side application framework that makes it very easy to get a lot accomplished with very little code.  Once you understand the basics of how Ember.js handles MVC (it's a little different from server-side MVC!) and routing, you will enjoy the productivity boosts the framework offers you.  In this session I'll introduce you to Ember.js basics, how to handle data, and how to use Handlebars templating to build your application.  Upon leaving the session, you'll be ready to join Groupon and Square and many other companies using this hot front-end framework! ","persons":[{"id":122,"full_public_name":"Brent Schooley","abstract":"Brent is a Developer Evangelist for Twilio representing the Philadelphia metro. He is a software developer who has been working with Microsoft technologies since 2004. His interests include client and mobile application development and user experience design with a recent emphasis on cross-platform mobile applications and client-side JavaScript frameworks. Other platforms he has worked with include WPF, Silverlight, Windows Forms, Windows Phone, and Windows 8. Brent is the author of Designing for Windows 8, a Windows 8 design primer from Apress. He is a Microsoft MVP in Client App Development as well as a Xamarin MVP.","avatar_path":"/system/avatars/122/large/brentavatwit.png?1409170829","twitter_name":"brentschooley"}]},{"id":73,"title":"The Ultimate Titanium CLI Toolchain","abstract":"Though Studio has improved a lot, the CLI has as well - allowing you to use your own favourite editor instead and even increase your productivity by using some community-developed tools like TiShadow, gitTio, Grunt, TiCons, Ti-Inspector, STSS and many more.\r\n","persons":[{"id":104,"full_public_name":"Fokke Zandbergen","abstract":"Based in The Netherlands, Fokke is an active contributor to the international Titanium community. As a Titan he's a developer advocate of the Titanium platform and co-leads the Dutch user group in Amsterdam. He's also a Titanium Certified Instructor and likes to speak from what he learns building apps himself.","avatar_path":"/system/avatars/104/large/GestreeptOpWit.jpg?1408710992","twitter_name":"FokkeZB"}]},{"id":18,"title":"Famo.us: The Future of the Mobile Web?","abstract":"Native has won. The mobile web is dead. Or is it? Armed with sexy demos powered by a 3D physics and rendering engine, a new JavaScript framework called Famo.us has caught the eye of both developers and investors. This has people asking once again… what does the future hold for mobile web development? Come explore the history of the more popular mobile web frameworks of the past and participate in a deep dive into what has been positioned as the future of mobile web development, Famo.us. Learn what it is, how it works and see it in action.","persons":[{"id":34,"full_public_name":"Chris Halaschek","abstract":"Chris Halaschek is a platform architect who has been building real-time, web-based systems for the past 10+ years. Currently, he is the CTO of Voxa LLC, a workflow automation platform for Salesforce.com. Prior to Voxa, Chris was the CTO of San Francisco based mobile game developer, HashGo Inc. and CTO at financial services firm, Clados Management LLC.\r\n\r\nChris holds a Ph.D. in Computer Science from the University of Maryland, College Park. He additionally earned his M.S. and B.S. in Computer Science from the University of Georgia.","avatar_path":"/system/avatars/34/large/chris-gray.jpg?1407339815","twitter_name":"chalaschek"}]},{"id":106,"title":"Building Proximity-Based Retail Experience for Cross-Platform Devices","abstract":"Our world is driven by exploration. It is a basic human intuition that has given us the ability to form decisions, beliefs, and reasoning. We can encourage discovery and build more intimate relationship with consumers through proximity-based technologies. Whether you’re attending a baseball game in the stands or watching it on TV, it is a shared experience. This session will share various use cases that leverage this to create a lasting and meaningful process for consumers.\r\n","persons":[{"id":25,"full_public_name":"Jae Lee","abstract":"Founder and CEO of @MovableAds, former UX Team Lead Software Engineer @Cheil_Worldwide and CS Lecturer at University of Jendouba","avatar_path":"/system/avatars/25/large/leejaew_head.png?1407211831","twitter_name":"leejaew"}]},{"id":4,"title":"Piloting Hyperdrive Spacecraft through Asteroids","abstract":"Best Practices for Piloting Hyperdrive Spacecraft. How to fly a large spacecraft with a furry co-pilot and avoid Imperial recon patrols.","persons":[{"id":8,"full_public_name":"Han Solo","abstract":"Captain, the Millennium Falcon","avatar_path":"/system/avatars/8/large/han-solo-star-wars.jpg?1406386119","twitter_name":"OfficialHanSolo"}]},{"id":86,"title":"Moving from PHP to a Nodejs full stack CMS","abstract":"KeystoneJS is a relatively new CMS that allows js developers to quickly implement a solution using a tech stack they feel comfortable with. \r\n\r\nImagine that you could drop your wordpress site and use a full stack CMS that uses modern web frameworks and a nodejs back end to swap out PHP for javascript.  If you have been developing javascript applications, you can use the following familiar tools:\r\n\r\n* nodejs\r\n* express\r\n* mongo\r\n* yeoman with bootstrap generators as well as support for LESS\r\n* your favorite templating engine - handlebars, jade, mustache\r\n\r\nWe'll cover everything from setup, implementation and deployment","persons":[{"id":57,"full_public_name":"Andrew Zuercher","abstract":"","avatar_path":"/system/avatars/57/large/3272225.jpg?1409062130","twitter_name":"Bahzuercher"}]},{"id":9,"title":"Workshop: Building Native Mobile Apps with JavaScript using Titanium","abstract":"Bring your laptop! Use your JavaScript skills to build *native* iOS and Android apps! \r\n\r\n*** This workshop requires separate registration and is not included in the main conference fee\r\n\r\nThis is a 1/2 day workshop specifically designed to get you up and running with Titanium and build feature-rich applications! We'll install the latest Titanium Developer and iOS SDK - then create a project in Titanium Developer and run it in the simulator to verify your setup.  Basic JavaScript experience is necessary for this session; please complete a basic JavaScript course or book before attending.\r\n\r\nTitanium is an open-source development tool for producing cross-platform mobile applications by Appcelerator. Using Titanium, you develop your mobile application using Javascript coded against the Titanium API's. Titanium Studio, an IDE for your mobile apps, invokes their compiler and builder to take your Javascript and build a native application for iOS and Android.","persons":[{"id":86,"full_public_name":"Edwin Huertas","abstract":"","avatar_path":"/system/avatars/86/large/IMG_1580.JPG?1408928455","twitter_name":"edwinRVA"}]},{"id":66,"title":"Merging JS front end and back end","abstract":"Progressive/pre rendering, SEO optimization & realtime/offline sync are some of the magic to be had by combining JavaScript on the front and back end (Node.js). I’ll show some of the tools & techniques for utilizing code on both sides, from Browserify, remoting to isomorphic modeling techniques in Angular and Node. Propel your project, save time by reusing code & libraries; plus it’s fun to be a full-stack ninja.","persons":[{"id":98,"full_public_name":"Shubhra Kar","abstract":"Shubhra Kar, Director, Products and Systems Engineering at StrongLoop Inc., is an accomplished Node and J2EE technologist with extensive global expertise as an architect, management consultant, product manager, and thought leader. Focussed on emerging tech, for over 15 years and across three continents, he has built and delivered successful solutions with Fortune 500 corporations, helping them bridge the gap between business and IT.","avatar_path":"/system/avatars/98/large/Pic_ShubhraKar.jpg?1408578311","twitter_name":"@shubhrakar"}]},{"id":89,"title":"Advanced React.js","abstract":"React is a library by FaceBook for building user interfaces. In this talk we'll explore React using real world examples. Examine complex UI's and how managing view state can quickly complect your design and data consistency. We'll also look at how other languages solve these problems. Finally, we'll see how layering the right technologies together we can simplify our solutions when building dynamic Web UI's.","persons":[{"id":113,"full_public_name":"Clint Ayres","abstract":"Full stack web developer for <a href=\"http://www.theice.com\">ICE</a> in Atlanta. Over the last year I've built, with the help of a great team, three high profile web applications, including the newly branded <a href=\"http://www.nyse.com\">NYSE.</a> I'm passionate about craftsmanship and community in web development.","avatar_path":"/system/avatars/113/large/1869117.jpeg?1409065085","twitter_name":""}]},{"id":33,"title":"Building JavaScript Visualizations Part 2","abstract":"D3.js is today's most powerful JavaScript framework for building data visualizations in the web browser. It has a reputation, however, for being complex and difficult to learn. This presentation examines the principles behind D3's architecture and shows how that architecture supports the creation of complex, compelling visualizations.","persons":[{"id":27,"full_public_name":"Stephen A Thomas","abstract":"Stephen specializes in front-end development at Georgia Tech’s Department of Education Technology where he is helping to build the <a href=\"http://www.oaeproject.org\">Open Academic Environment</a>. He is the author of <a href=\"http://www.amazon.com/Stephen-A.-Thomas/e/B000APYM22\">several books</a> on the Internet and networking technology and has written about JavaScript development for <a href=\"http://mobile.smashingmagazine.com/2013/07/22/simple-responsive-images-with-css-backgrounds/\">Smashing Magazine</a>, <a href=\"http://www.sitepoint.com/unit-testing-backbone-js-applications/\">sitepoint</a> and <a href=\"http://ui-cloud.com/web-based-visualization-part-1-the-d3-js-key-concept/\">others</a>. His most recent book is <em>Building JavaScript Visualizations</em> from No Starch Press.","avatar_path":"/system/avatars/27/large/me.png?1407255208","twitter_name":"stephen_thomas"}]},{"id":42,"title":"Alloy vs CommonJS","abstract":"This talk will look at how Titanium has implemented commonJS and what Alloy is, and when each should or could be used. It will include what a commonJS app looks like, and how it is used with Alloy.\r\n","persons":[{"id":68,"full_public_name":"Trevor Ward","abstract":"Appcelerator Titanium Titan. Coder, Geek & blogger","avatar_path":"/system/avatars/68/large/12593df.jpg?1408124419","twitter_name":"@thewarpedcoder"}]},{"id":17,"title":"Securing AngularJS applications","abstract":"AngularJS provides an outstanding way to create highly responsive and portable applications, however as with most web applications security can be challenging.  This talk will present a practical approach to designing, developing, and testing a secure AngularJS application and the RESTful web services that support it.","persons":[{"id":33,"full_public_name":"Dennis Hurst","abstract":"Dennis Hurst has 14 years of experience in the Application Security industry and has been a developer for over 25 years of development experience.  He has worked with developers around the world improving the security of their application and was the original developer of WebInspect (now and HP product).","avatar_path":"/system/avatars/33/large/Dennis_Hurst.jpg?1407328191","twitter_name":"@dennishurst"}]}]}
